{"/devjob.plan/privacy/":{"data":{"":"devjob.plan Privacy PolicyEffective Date: December 24, 2025\nA journal is a personal thing. For that reason, devjob.plan (DJP) and RealProven, LLC treat your privacy as an essential feature of this experience. The specifics are as follows:","changes-to-this-policy#Changes to This Policy":"We will update this policy if our practices change and notify you via the app or website.\nIf you have any specific questions about this policy that aren’t answered here, please feel free to contact us.","data-security#Data Security":"Your journal data is protected by macOS file system security and, when using iCloud, Apple’s encryption standards.","data-sharing#Data Sharing":"We do not share, sell, or transmit any of your data to third parties, except as required by law.","data-we-collect#Data We Collect":"Journal Notes and Document Content\nAll journal entries, notes, and document data are stored exclusively on your device (and in iCloud if you enable it for your own syncing/backup). We never access, transmit, or store this data on our servers.\nSearch and Browsing Interactions\nDJP monitors browsing within the integrated web view (e.g., URLs visited, page titles, extracted job-related elements) solely to help you add relevant content to your personal journal. This data is used only locally to support journaling features and is not transmitted, stored long-term, or shared in any way.\nNo Other Data Collection\nWe do not collect analytics, usage data, crash reports, or any other information about how you use the app.","devjobplan-privacy-policy#devjob.plan Privacy Policy":"","your-rights#Your Rights":"You control all your data. You can view, edit, export, or delete your journals at any time. Uninstalling the app removes all local data."},"title":"_index"},"/devjob.plan/support/":{"data":{"":"Getting Support","bugs-and-feature-requests#Bugs and Feature Requests":"Submit with GitHub Issues.","contact-us#Contact Us":"Send an email for anything else.","devjobplan-features#devjob.plan Features":"The integrated help in the app is the authoritative source for all user-visible features.","getting-support#Getting Support":""},"title":"_index"},"/devjob.plan/tos/":{"data":{"":"devjob.plan Terms of ServiceEffective Date: December 24, 2025\nBy downloading or using devjob.plan (DJP), you agree to these terms. If you do not agree, do not use the app.","1-license#1. License":"We grant you a limited, non-exclusive license to use DJP for personal, non-commercial purposes.","2-user-responsibilities#2. User Responsibilities":"You must comply with all laws and not misuse the app (e.g., no scraping, no harmful content). Journal content is your responsibility; we are not liable for loss or misuse.","3-disclaimers-and-limitations#3. Disclaimers and Limitations":"DJP is provided “as is” without warranties. We are not liable for any damages arising from use, including job search outcomes.","4-termination#4. Termination":"We may terminate access if you violate these terms.","5-governing-law#5. Governing Law":"These terms are governed by the laws of [Your State/Country, e.g., California, USA].\nFor questions, contact us.","devjobplan-terms-of-service#devjob.plan Terms of Service":""},"title":"_index"}}